ProgessBase/DataProcessors/СогласованиеЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СогласованиеЗаявок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизвольныеОтчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненнаяНастройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СохраненныеНастройки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаявкиНаРасходованиеСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийЗаявкиНаРасходование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРасхода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчетКасса</Name>
							<Comment>Банковский счет, касса</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееСостояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийСогласующий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ProgessBase/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ОтправкаПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ОтправкаПочты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/Enums/СостоянияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияОбъектов</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Enums/ВидыДвиженийПриходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДвиженийПриходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Catalogs/МаршрутыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МаршрутыСогласования</Name>
			<Comment>Маршруты согласования заявок на расходование денежных средств</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СогласующиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/DataProcessors/СогласованиеЗаявок/Ext/ObjectModule.bsl
Функция ОбработатьСогласованиеЗаявок() Экспорт
	
	//Получим этапы согласования текущего пользователя
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка КАК МаршрутСогласования
	               |ИЗ
	               |	Справочник.МаршрутыСогласования.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |ГДЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Пользователь = &ТекПользователь";
				   
	Запрос.УстановитьПараметр("ТекПользователь", ТекущийПользователь);
	ЭтапыТекущегоПользователя = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МаршрутСогласования");
	СоответствиеСледующиеЭтапы = Новый Соответствие();
	
	ЕстьОшибки = Ложь;
	
	УспешноОбработанныеЗаявки = Новый Массив;
	
	Для Каждого СтрокаТабличнойЧасти ИЗ ЗаявкиНаРасходованиеСредств Цикл
		Если НЕ СтрокаТабличнойЧасти.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Состояние)
			ИЛИ (СтрокаТабличнойЧасти.ПоследнийСогласующий = ТекущийПользователь
			    // <- Шевченков 20170313 #62814
			    И СтрокаТабличнойЧасти.Этап.Родитель.СогласующиеЛица.Найти(ТекущийПользователь) = Неопределено
				// ->
				И СтрокаТабличнойЧасти.ТекущееСостояние = СтрокаТабличнойЧасти.Состояние) Тогда
				
			УспешноОбработанныеЗаявки.Добавить(СтрокаТабличнойЧасти);
			Продолжить;
		КонецЕсли;

		Отказ = Ложь;
		ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ЗаявкиНаРасходованиеСредств", СтрокаТабличнойЧасти.НомерСтроки, "Дата");
		
		Если СтрокаТабличнойЧасти.ПоследнийСогласующий = ТекущийПользователь
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Этап.Родитель) Тогда
			
			НовыйЭтап = СтрокаТабличнойЧасти.Этап;
			
		Иначе
			
			//Определим новый этап - это может быть следующий этап (непосредственный родитель) 
			//	или один из вышестоящих этапов
			НовыйЭтап = Неопределено;
			ОпределитьСледующийЭтапСогласования(НовыйЭтап, СтрокаТабличнойЧасти.Этап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы);
			
			//Если новый этап не удалось определить - сообщим об ошибке
			//	Такой ситуации возникать не должно.
			Если НовыйЭтап = Неопределено Тогда
				ТекстСообщения = НСтр("ru = 'Не удалось определить следующий этап согласования заявки &Заявка.
											|Состояние заявки изменено не будет.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Заявка", СтрокаТабличнойЧасти.Заявка);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ТекстПоля,, Отказ);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НовыйУровень = НовыйЭтап.Уровень() + 1;
		
		//Обработаем состояние Отказано
		Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Отклонен
			И СтрокаТабличнойЧасти.Заявка.Проведен Тогда
			
			Попытка
				ЗаявкаОбъект = СтрокаТабличнойЧасти.Заявка.ПолучитьОбъект();
				ЗаявкаОбъект.ПКК_АктНачисленияБонусов = Документы.ПКК_АктНачисленияБонусовУслуг.ПустаяСсылка();
				ЗаявкаОбъект.Заблокировать();
				ЗаявкаОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось отменить проведение документа &Заявка.
											|Состояние заявки изменено не будет.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Заявка", СтрокаТабличнойЧасти.Заявка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ТекстПоля,, Отказ);
			КонецПопытки;
		КонецЕсли;
		
		// Обработаем изменение состояния с Отказано на другое
		Если СтрокаТабличнойЧасти.ТекущееСостояние = Перечисления.СостоянияОбъектов.Отклонен 
			И НЕ СтрокаТабличнойЧасти.Заявка.Проведен Тогда
			
			Попытка
				ЗаявкаОбъект = СтрокаТабличнойЧасти.Заявка.ПолучитьОбъект();
				ЗаявкаОбъект.Заблокировать();
				ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось провести документ &Заявка.
											|Состояние заявки изменено не будет'");
											
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Заявка", СтрокаТабличнойЧасти.Заявка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ТекстПоля,, Отказ);
			КонецПопытки;
		КонецЕсли;
		
		Если Отказ Тогда
			ЕстьОшибки = Истина;
			Продолжить;
		КонецЕсли;
		
		//Изменим состояние заявки в регистре
		НаборЗаписейСостояниеСогласования = РегистрыСведений.СостоянияСогласованияЗаявок.СоздатьНаборЗаписей();
		НаборЗаписейСостояниеСогласования.Отбор.Заявка.Установить(СтрокаТабличнойЧасти.Заявка);
		НаборЗаписейСостояниеСогласования.Прочитать();
		
		//Проверим последнюю запись - если она относится к тому же пользователю и этапу, удалим ее
		Если НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
			ПоследняяЗапись = НаборЗаписейСостояниеСогласования[НаборЗаписейСостояниеСогласования.Количество()-1];
			Если ПоследняяЗапись.Пользователь = ТекущийПользователь
				И ПоследняяЗапись.Этап = НовыйЭтап Тогда
				
				НаборЗаписейСостояниеСогласования.Удалить(ПоследняяЗапись);
			КонецЕсли;
		КонецЕсли;

		Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Согласован
			И НовыйУровень = 1 Тогда
			
			НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден;
		Иначе
			НовоеСостояние = СтрокаТабличнойЧасти.Состояние;
		КонецЕсли; 
		
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		НоваяЗапись.Период       = ТекущаяДата();
		НоваяЗапись.Активность   = Истина;
		НоваяЗапись.Заявка       = СтрокаТабличнойЧасти.Заявка;
		НоваяЗапись.Пользователь = ТекущийПользователь;
		НоваяЗапись.Состояние    = НовоеСостояние;
		НоваяЗапись.Уровень      = НовыйУровень;
		НоваяЗапись.Этап         = НовыйЭтап;
						
		// <- Шевченков проверка когда для этапа друг за другом имеют одинаковых согласующих
		Попытка
			Если НовыйЭтап.Уровень() > 0 Тогда
				Если НовыйЭтап.Родитель.СогласующиеЛица.Найти(ТекущийПользователь) <> Неопределено Тогда			
					//НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					//НоваяЗапись.Период       = ТекущаяДата();
					//НоваяЗапись.Активность   = Истина;
					//НоваяЗапись.Заявка       = СтрокаТабличнойЧасти.Заявка;
					//НоваяЗапись.Пользователь = ТекущийПользователь;
					//НоваяЗапись.Состояние    = НовоеСостояние;
					НоваяЗапись.Уровень      = ?(НовыйЭтап.Родитель.Уровень()<1, 1, НовыйЭтап.Родитель.Уровень());
					НоваяЗапись.Этап         = НовыйЭтап.Родитель;
					//НаборЗаписейСостояниеСогласования.Записать();
				КонецЕсли;       				
			КонецЕсли;			
		Исключение
			ПРГ_Регламентый.ОтправитьУведомление(ПРГ_Регламентый.ПолучитьАдресЭлПочты(Справочники.Пользователи.НайтиПоКоду("Шевченков А.В.").ФизЛицо), "Ошибка в согласовании заявок (повторяются согласующие)", Строка(СтрокаТабличнойЧасти.Заявка));
		КонецПопытки;		
		// ->
		
		НаборЗаписейСостояниеСогласования.Записать();
		
		//начало изменений 
		ЗаявкаОбъект = СтрокаТабличнойЧасти.Заявка.ПолучитьОбъект();
		Если ЗаявкаОбъект.Состояние <> НовоеСостояние Тогда
			Если НовоеСостояние = Перечисления.СостоянияОбъектов.Отклонен Тогда
				ЗаявкаОбъект.ПКК_АктНачисленияБонусов = Документы.ПКК_АктНачисленияБонусовУслуг.ПустаяСсылка();
			КонецЕсли;			
			ЗаявкаОбъект.Состояние = НовоеСостояние;
			///ЗаявкаОбъект.Заблокировать(); пока без блокировки
			ЗаявкаОбъект.ОбменДанными.Загрузка = истина;
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		// <- Шевченков
		Попытка
			БылаОшибка = Ложь;
			//ПРГ_Регламентый.ПодготовитьУведомление(ЗаявкаОбъект.Ссылка, СтрокаТабличнойЧасти.Состояние); // Шевченков
			ПРГ_Регламентый.ПодготовитьУведомление(ЗаявкаОбъект.Ссылка, ?(ЗначениеЗаполнено(НовоеСостояние), НовоеСостояние, СтрокаТабличнойЧасти.Состояние)); // Шевченков
		Исключение
			БылаОшибка = Истина;
			ТекОшибка = ОписаниеОшибки();
			Сообщить(ТекОшибка);			
		КонецПопытки;	
		
		Если БылаОшибка Тогда
			Попытка
				ТемаПисьма = Строка(ЗаявкаОбъект) + " ошибка при отправке уведомления";
				ПРГ_Регламентый.ОтправитьУведомление(ПРГ_Регламентый.ПолучитьАдресЭлПочты(Справочники.Пользователи.НайтиПоКоду("Шевченков А.В.").ФизЛицо), ТемаПисьма, Строка(ТекОшибка) + Символы.ПС + Символы.ПС + "Пользователь: " + ПараметрыСеанса.ТекущийПользователь);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;		
		КонецЕсли;		
		// ->
		//конец изменений 
		
		УспешноОбработанныеЗаявки.Добавить(СтрокаТабличнойЧасти);
		
	КонецЦикла;
	
	// Удалим из списка заявки по которым удалось изменить состояние
	Для каждого ЭлКоллекции Из УспешноОбработанныеЗаявки Цикл
		ЗаявкиНаРасходованиеСредств.Удалить(ЭлКоллекции);
	КонецЦикла; 
	
	Возврат НЕ ЕстьОшибки;
	
КонецФункции

Процедура ПодготовитьУведомлениеНаПочкуСледСогласующему(ЗаявкаНаРасход = Неопределено, ФизЛицоСогласующего = Неопределено)
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК ЭлектроннаяПочта
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип";
	Запрос.УстановитьПараметр("Объект", ФизЛицоСогласующего);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Количество() = 1 Тогда
		
		НаборЗаписейСостояниеСогласования = РегистрыНакопления.ОтправкаПочты.СоздатьНаборЗаписей();
		НаборЗаписейСостояниеСогласования.Отбор.Заявка.Установить(ЗаявкаНаРасход);	
		НаборЗаписейСостояниеСогласования.Прочитать();
		НоваяЗапись                = НаборЗаписейСостояниеСогласования.Добавить();    	
		НоваяЗапись.Период         = ЗаявкаНаРасход.Дата;
		НоваяЗапись.Активность     = Истина;
		НоваяЗапись.Заявка         = ЗаявкаНаРасход;
		НоваяЗапись.ФизическоеЛицо = ФизЛицоСогласующего;
		НоваяЗапись.ВидДвижения    = Перечисления.ВидыДвиженийПриходРасход.Приход;
		НоваяЗапись.ЭлектроннаяПочта = Рез[0].ЭлектроннаяПочта;	
		НаборЗаписейСостояниеСогласования.Записать();
		
	Иначе
		
		Возврат;
		
	КонецЕсли;  	
	
КонецПроцедуры
 
//Процедура определяет этап согласования, который соответствует маршруту согласования и текущему пользователю
Процедура ОпределитьСледующийЭтапСогласования(НовыйЭтап, ТекущийЭтап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы)
	
	НовыйЭтап = СоответствиеСледующиеЭтапы.Получить(ТекущийЭтап);
	
	Если НовыйЭтап = Неопределено Тогда
		Если ЭтапыТекущегоПользователя.Найти(ТекущийЭтап)<>Неопределено Тогда
			НовыйЭтап = ТекущийЭтап;
			СоответствиеСледующиеЭтапы.Вставить(ТекущийЭтап, НовыйЭтап);
		ИначеЕсли ЗначениеЗаполнено(ТекущийЭтап.Родитель) Тогда
			ОпределитьСледующийЭтапСогласования(НовыйЭтап, ТекущийЭтап.Родитель, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
